[display]
width = 800		;窗口大小
height = 600		;窗口大小

[version]
version = 1.2.2.0	;版本号

[section]
id = 90001		;大区ID

[zone_server]
num = 2			;连接的loongworld的数量

[zone_session]  	;和ZoneServer通信参数
port = 5050		;和LoongWorld通信的端口

[player_session] 	;和客户端通信参数
port = 4200	 	;和客户端通信的端口

[zone0]
id = 30001		;游戏世界ID
name = 小三世界		;游戏世界名称
auto_seal = 1		;反外挂程序是否自动封号

[zone1]
id = 30002		;游戏世界ID
name = 帮派测试		;游戏世界名称
auto_seal = 1		;反外挂程序是否自动封号


[database]
ip	= 172.17.1.170	;帐号库IP
user	= root		;用户名
psd	= loongdb	;密码
name	= login_gxl	;帐号库数据库名
port    = 3306		;数据库密码

[world_state]
update_time = 5000;	;世界人数状态DB更新时间（毫秒）
insert_time = 10000

[gm_server]
ip = 172.17.3.23		;GMServerIP
port = 6600		;GMServer端口

[golden_code]
login_server = 300	;LoginServer的金色代码
zone_server =  292	;LoongWorld的金色代码

[proof]
policy = 0		;验证策略，0——普通策略 1——中央激活策略
			;2——迅雷验证 3——台湾游戏橘子

[fatigue_guard]
;海外：不模拟防沉迷服务器，不开启防沉迷
;外服：不模拟防沉迷服务器，开启防沉迷
;精英：模拟防沉迷服务器，开启防沉迷

sim_server		= 1;	模拟防沉迷服务器
guard_switch	= 1; 防沉迷开关

;下面选项是防沉迷服务器相关的设置，只有在开启防沉迷时有效
ip	=	220.248.115.18	;防沉迷服务器的ip
port	=	12345		;防沉迷服务器的端口
circle =	1 			;（ 单位 秒）向fatigue_server发所有当前在线防沉迷玩家帐号的周期

